app/controllers/manufacturers_controller.rb

  def index
    @manufacturers = Manufacturer.all
---
SELECT "manufacturers".* FROM "manufacturers"

  def create
    @manufacturer = Manufacturer.new(manufacturer_params)

    respond_to do |format|
      if @manufacturer.save
---
INSERT INTO "manufacturers" ("city", "created_at", "name", "state", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "Atlanta"], ["created_at", "2014-05-06 12:14:32.780707"], ["name", "Toyota"], ["state", "GA"], ["updated_at", "2014-05-06 12:14:32.780707"]]

    def set_manufacturer
      @manufacturer = Manufacturer.find(params[:id])
---
SELECT  "manufacturers".* FROM "manufacturers"  WHERE "manufacturers"."id" = ? LIMIT 1  [["id", 1]]