app/controllers/productmanufacturer_controller.rb

SELECT  "products".* FROM "products"   ORDER BY "products"."id" DESC LIMIT 1
---
  def showproducts

 	@products = Product.all

SELECT "manufacturers".* FROM "manufacturers"  WHERE "manufacturers"."city" = 'Macon'
---
  def showmanufacturers
  	@manufacturers = Manufacturer.where(city: "Macon")

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
---
  def findproduct

  	current_product_id = 2

  	@product = Product.find(current_product_id)

SELECT "products".* FROM "products"  WHERE "products"."manufacturer_id" = 2  ORDER BY "products"."name" ASC
---
  def find_products_by_manu
  	@products = Product.where(manufacturer_id: 2).order(:name)