app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("color", "created_at", "manufacturer_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["color", "blue"], ["created_at", "2014-05-06 12:17:14.926538"], ["manufacturer_id", 3], ["name", "Accord"], ["updated_at", "2014-05-06 12:17:14.926538"]]