app/controllers/users_controller.rb

INSERT INTO "users" ("age", "bio", "created_at", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["age", 36], ["bio", "I am a teacher and coder"], ["created_at", "2014-04-29 13:11:54.856666"], ["first_name", "TJ"], ["last_name", "Muehleman"], ["updated_at", "2014-04-29 13:11:54.856666"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save